{
  "nasa": {
    "username": "nasa",
    "full_name": "NASA",
    "biography": "🚀 🌎  Exploring the universe and our home planet. Verification: nasa.gov/socialmedia",
    "followers": 96340264,
    "followees": 80,
    "total_posts": 4518,
    "external_url": "https://www.nasa.gov/",
    "recent_posts": [
      {
        "shortcode": "DNQuxufAih9",
        "caption": "Under the sea🪸⁣\n ⁣\nIn 2020, @NASAHubble released this image, nicknamed the “Cosmic Reef,” to celebrate 30 years in space. It shows a giant red nebula and its smaller blue neighbor, which are both part of a vast star-forming region in the Large Magellanic Cloud, a satellite galaxy of the Milky Way, located 163,000 light-years away. In this picture, we can see how young, energetic, massive stars illuminate and sculpt their birthplace with powerful winds and searing ultraviolet radiation.⁣\n ⁣\nAt the heart of the big red nebula are sparkling stars, each of which are 10 to 20 times more massive than our Sun. The stars' ultraviolet radiation heats the surrounding dense gas. The massive stars also unleash fierce winds of charged particles that blast away lower-density gas, forming the bubble-like structures seen on the right, which resemble coral.⁣\n ⁣\nBy contrast, the seemingly isolated blue nebula at lower left was created by a solitary mammoth star 200,000 times brighter than our Sun. The blue gas was ejected by the star through a series of eruptive events during which it lost part of its outer envelope of material.⁣\n ⁣\nImage description: An image is split in two. In the bottom left of the first image a bright blue ring appears, slightly fading in all directions, with a small blue dot in the middle. Red and orange waves of gas ripple, arcing from top left to top right. A light blue center appears out of the sea of red, and several bright white dots shine through. In the top right, dark blue gas emanates from the blackness of space.⁣\n\nCredit: NASA, ESA, STScI⁣\n ⁣\n#NASA #Hubble #CoralReef #Nebula #Stars #Astronomy",
        "image_url": "https://instagram.fcbr2-1.fna.fbcdn.net/v/t51.2885-15/531774345_18540287185049152_7874995044152401858_n.jpg?stp=dst-jpg_e35_tt6&efg=eyJ2ZW5jb2RlX3RhZyI6IkNBUk9VU0VMX0lURU0uaW1hZ2VfdXJsZ2VuLjEwODB4MTM1MC5zZHIuZjgyNzg3LmRlZmF1bHRfaW1hZ2UuYzIifQ&_nc_ht=instagram.fcbr2-1.fna.fbcdn.net&_nc_cat=104&_nc_oc=Q6cZ2QH3SOpYargooahdf49bjUu_cogVBmgIq5zFu0g_X4-UBjK1KmEmJAUXSbB0Y3TNntA&_nc_ohc=ftHsTwlg5vMQ7kNvwHjjxWN&_nc_gid=DfW-AknnqZEyNb_En3yu4w&edm=AEhyXUkBAAAA&ccb=7-5&ig_cache_key=MzY5NzY2MDk2OTgzMjgwODA4NA%3D%3D.3-ccb7-5&oh=00_AfW0NYb9lPsW6_byEhIPxAFDjv50YMrzXrv9DB3I7DNXlg&oe=68BC4FB7&_nc_sid=8f1549",
        "likes": 600003,
        "date_utc": "2025-08-12T16:19:28"
      },
      {
        "shortcode": "DL5KetROhWu",
        "caption": "At NASA, we’re redefining the mirror selfie.⁣\n⁣\nAstronaut Zena Cardman pauses to inspect her spacesuit’s wrist mirror, a small but crucial tool for reading suit displays and controls. This portrait, taken at @NASAJohnson in Houston, Texas, shows one of the many small moments of preparation in an astronaut’s journey to spaceflight.⁣\n⁣\nCardman, a Virginia native, is gearing up for her first spaceflight to the International Space Station as part of our SpaceX Crew-11 mission, scheduled to launch later this summer. Selected in the “Turtles” astronaut class of 2017, she has a research background in geobiology, with degrees in biology and marine sciences from the University of North Carolina, Chapel Hill.⁣\n⁣\nHer experience includes multiple expeditions to Antarctica as part of her studies of life in extreme environments like caves and deep-sea sediments. Now, she’s taking on the next frontier.⁣\n⁣\nThis photo was one of NASA’s 2024 Photos of the Year, capturing the calm determination required in every moment of an astronaut’s training—even routine spacesuit checks.⁣\n⁣\nImage description: Astronaut Zena Cardman wears a white spacesuit and looks down while adjusting a small mirror on her wrist, attached to her left glove. She is photographed against a dark background at Johnson Space Center.⁣\n⁣\nCredit: NASA/Josh Valcarcel⁣\n⁣\n#NASA #Astronaut #SpaceX #NASAPhotoOfTheYear #MirrorSelfie",
        "image_url": "https://instagram.fcbr2-1.fna.fbcdn.net/v/t51.2885-15/516513244_18534178162049152_7010594162229503875_n.jpg?stp=dst-jpg_e35_tt6&efg=eyJ2ZW5jb2RlX3RhZyI6IkZFRUQuaW1hZ2VfdXJsZ2VuLjE0NDB4OTU5LnNkci5mODI3ODcuZGVmYXVsdF9pbWFnZS5jMiJ9&_nc_ht=instagram.fcbr2-1.fna.fbcdn.net&_nc_cat=104&_nc_oc=Q6cZ2QH3SOpYargooahdf49bjUu_cogVBmgIq5zFu0g_X4-UBjK1KmEmJAUXSbB0Y3TNntA&_nc_ohc=GwXFdCq9-AcQ7kNvwG4BG5o&_nc_gid=DfW-AknnqZEyNb_En3yu4w&edm=AEhyXUkBAAAA&ccb=7-5&ig_cache_key=MzY3MzAxMzA2MTc1NDE2NDY1NA%3D%3D.3-ccb7-5&oh=00_AfX3vpKVOE8MgdfwCH4OMPUQmdSgCBgAKdBJhaoiYKv1Rg&oe=68BC3CAA&_nc_sid=8f1549",
        "likes": 174380,
        "date_utc": "2025-07-09T16:08:25"
      },
      {
        "shortcode": "DNqVTidT0R-",
        "caption": "Baby, I can see your halo 🌒😇\n \nAstronaut Matthew Dominick on the International Space Station captured this photo of an arc shape, called a partial lunar halo, cradling the Moon on Sept. 4, 2024. \n \nAt the time of this photo, the Moon was positioned ‘behind’ Earth’s atmosphere relative to the @ISS. Earth’s atmosphere – seen as layers of orange, white, and blue – acts like a lens, bending light that passes through it and toward the astronaut’s camera. \n \nAs that light passed through Earth’s upper atmosphere, it hit ice crystals that form when water vapor freezes onto tiny dust particles. These ice crystals bent, or refracted, the light, forming an arc that looks like a halo by the Moon!\n \nThrough NASA’s Artemis campaign, we’re learning more about our Moon than ever before. Next up is Artemis II, which will send a human crew to orbit the Moon for the first time in over 50 years. Follow @nasaartemis for more updates.\n \nImage description: A photograph of an arc-shaped strip of white light cradling the Moon on its lower right side. Earth takes up the lower third of the image and is dark black. Above it are the glowing, colorful layers of Earth’s atmosphere, which are orange, red, white, and blue. The Moon is bright white, visible near the top of the blue atmospheric layer where it fades into the blackness of space. \n \nCredit: NASA/Matthew Dominick\n \n#NASA #Moon #SpaceStation #Earth #Space #ISS",
        "image_url": "https://instagram.fcbr2-1.fna.fbcdn.net/v/t51.2885-15/537736670_18542023156049152_6663003482099083075_n.jpg?stp=dst-jpg_e35_tt6&efg=eyJ2ZW5jb2RlX3RhZyI6IkZFRUQuaW1hZ2VfdXJsZ2VuLjE0NDB4MTQzOS5zZHIuZjgyNzg3LmRlZmF1bHRfaW1hZ2UuYzIifQ&_nc_ht=instagram.fcbr2-1.fna.fbcdn.net&_nc_cat=1&_nc_oc=Q6cZ2QH3SOpYargooahdf49bjUu_cogVBmgIq5zFu0g_X4-UBjK1KmEmJAUXSbB0Y3TNntA&_nc_ohc=K6MqqNdy1zQQ7kNvwHYL57P&_nc_gid=DfW-AknnqZEyNb_En3yu4w&edm=AEhyXUkBAAAA&ccb=7-5&ig_cache_key=MzcwNDg2NzM0NTExMTQwMTU5OA%3D%3D.3-ccb7-5&oh=00_AfX4pCVTsgrIl0Vxk3YTliMGcX7uT-T6b8beAInAf6G4qg&oe=68BC6796&_nc_sid=8f1549",
        "likes": 968611,
        "date_utc": "2025-08-22T14:57:13"
      },
      {
        "shortcode": "DN8mjSFjdOm",
        "caption": "We’re going up, up, up, it’s our moment! 🎶 \n\nThe Nancy Grace Roman Space Telescope, which will unveil the cosmos in ways never before possible, has passed its deployment test at @NASAGoddard. The test ensures Roman’s solar panels and deployable aperture cover will unfold as planned in space.\n\nRoman, which will look for planets beyond our solar system and study essential questions in dark energy and astrophysics, is scheduled to lift off no later than May 2027 with the team aiming for as early as fall 2026.\n\nCheck out the link in @NASAUniverse’s Roman story highlight to learn more! \n\nVideo description is in the comments.\n\nVideo credit: NASA Goddard Space Flight Center \n\nMusic credit: “History in Motion” by Fred Dubois [SACEM], Koka Media [SACEM], Universal Publishing Production Music France [SACEM], and Universal Production Music\n\n#NASARoman #Astrophysics #SpaceTelescope",
        "image_url": "https://scontent.cdninstagram.com/v/t51.82787-15/540339845_18543281020049152_374907486710299024_n.jpg?stp=dst-jpg_e15_tt6&_nc_cat=110&ig_cache_key=MzcxMDAwOTc0MzQxNjA4NzQ2MjE4NTQzMjgxMDE3MDQ5MTUy.3-ccb1-7&ccb=1-7&_nc_sid=58cdad&efg=eyJ2ZW5jb2RlX3RhZyI6InhwaWRzLjQ1MHg4MDAuc2RyLkMzIn0%3D&_nc_ohc=E7vaKYD-rOcQ7kNvwFajfJe&_nc_oc=AdnNeHBSOL_YI4GXdWIsmTMGv9FThN2kAaSPKaat3ZLsBp868HRPm__3dQYOOLGrmiY&_nc_ad=z-m&_nc_cid=0&_nc_zt=23&_nc_ht=scontent.cdninstagram.com&_nc_gid=DfW-AknnqZEyNb_En3yu4w&oh=00_AfWLMkqUYAByL_NMXQJlgt_xss56GQZXD3JFnzR7p912Dg&oe=68BC3C4E",
        "likes": 51633,
        "date_utc": "2025-08-29T17:16:11"
      },
      {
        "shortcode": "DN6VeU5D6c4",
        "caption": "POV: You’re looking at the Moon outside of your window on the Orion spacecraft. \n\nThis visualization simulates what the crew of Artemis II might see out the Orion windows on the day of their closest approach to the Moon. It compresses 36 hours into a little more than a minute as it flies the virtual camera on a realistic trajectory that swings the spacecraft around the Moon's far side.\n\nNext year, the Artemis II astronauts could be the first humans to see some parts of the Moon’s far side with the naked eye, depending on the spacecraft’s final trajectory after it launches. During the nine Apollo missions that left Earth’s orbit, astronauts saw parts of the Moon’s far side, but not all of it, as they were limited by which sections were lit during their orbits.\n\nThe Artemis II crew’s observations will help pave the way for lunar science activities on future Artemis missions to the Moon’s surface, including Artemis III. Artemis III astronauts will investigate the landforms, rocks, and other features around their landing site. They will also collect rock samples for generations of analyses in Earth labs and set up several instruments to investigate lunar properties and resources — information critical to our future human exploration efforts.\n\nCredit: NASA's Scientific Visualization Studio\n\n#POV #Moon #FarSideOfTheMoon #Artemis #ArtemisII #Astronauts #LunarMission #STEM #Apollo #Orion",
        "image_url": "https://scontent.cdninstagram.com/v/t51.82787-15/540052696_18543112147049152_2861521367798583129_n.jpg?stp=dst-jpg_e15_tt6&_nc_cat=101&ig_cache_key=MzcwOTM3MTY4NjA4NjIyMzY3MjE4NTQzMTEyMTQ0MDQ5MTUy.3-ccb1-7&ccb=1-7&_nc_sid=58cdad&efg=eyJ2ZW5jb2RlX3RhZyI6InhwaWRzLjEwODB4MTkyMC5zZHIuQzMifQ%3D%3D&_nc_ohc=JzsbrDJOu8cQ7kNvwFOK_-5&_nc_oc=Adk9YG9HMaIq02Gf2b38ZQh3LLyxkNoc3b7T0bUTLUvVUuGiUz5FrvpRm2Cv6WrnB38&_nc_ad=z-m&_nc_cid=0&_nc_zt=23&_nc_ht=scontent.cdninstagram.com&_nc_gid=DfW-AknnqZEyNb_En3yu4w&oh=00_AfXZnc6i6ze_39dqA0UIubMc9iD_J13ekXpwgldzX9fyTA&oe=68BC62C4",
        "likes": 195870,
        "date_utc": "2025-08-28T20:06:53"
      }
    ]
  }
}