[
  {
    "username": "albomp",
    "shortcode": "DOIFRafE2pN",
    "taken_at": "2025-09-03T04:14:12",
    "is_video": false,
    "local_path": ".\\Static\\albomp\\DOIFRafE2pN.jpg",
    "caption": "We’re fully funding every school across the country - from schools in my community, to schools in Tassie and Western Australia.\n\nBecause every child in Australia deserves the best possible education, no matter where they live, or where they’re from.",
    "likes": 697,
    "comments": 79
  },
  {
    "username": "albomp",
    "shortcode": "DOH4NTuk729",
    "taken_at": "2025-09-03T02:20:03",
    "is_video": false,
    "local_path": ".\\Static\\albomp\\DOH4NTuk729.jpg",
    "caption": "Words can’t express the heart of Professor Richard Scolyer. \n\nHis melanoma research has saved thousands of lives and his personal fight against his own deadly brain cancer has inspired millions. \n\nNow, his legacy will live on through the Richard Scolyer Chair in Brain Cancer Research at the Chris O’Brien Lifehouse. \n\nFor everything you’ve done, thank you Richard.",
    "likes": 4178,
    "comments": 110
  },
  {
    "username": "albomp",
    "shortcode": "DOGIKFZEwz5",
    "taken_at": "2025-09-02T10:00:56",
    "is_video": false,
    "local_path": ".\\Static\\albomp\\DOGIKFZEwz5.jpg",
    "caption": "Whether it’s your local news, Friday Night Footy or the latest episode of Home and Away, free to air TV informs, entertains and connects. \n\nIt brings many Australians together and tonight we celebrated it.",
    "likes": 1885,
    "comments": 212
  },
  {
    "username": "albomp",
    "shortcode": "DOFWQQYE67f",
    "taken_at": "2025-09-02T02:44:52",
    "is_video": false,
    "local_path": ".\\Static\\albomp\\DOFWQQYE67f.jpg",
    "caption": "In just under 100 days, our social media ban for kids under 16 begins.\n\nIt will keep children safer, take the pressure off parents, and give young people more time to just be kids.\n\nWe know social media can cause real harm - from bullying to mental health struggles. \n\nNo one knows this better than Wayne, Emma and Fiona, who’ve bravely shared their stories of loss and advocacy.\n\nThis won’t be solved overnight, but we’re acting now to protect kids and support families.\n__\n\nWith: @anikawellsmp",
    "likes": 1554,
    "comments": 286
  },
  {
    "username": "albomp",
    "shortcode": "DODi-fnkzSc",
    "taken_at": "2025-09-01T09:57:34",
    "is_video": false,
    "local_path": ".\\Static\\albomp\\DODi-fnkzSc.jpg",
    "caption": "These students are learning what’s needed to shape our homes, industries and communities.\n\nAnd many of them are learning these skills through Free TAFE.\n\nFree TAFE is opening doors for more young Australians than ever before.\n\nIncluding the Skillaroos - who’ll take their Aussie skills to the world.",
    "likes": 2524,
    "comments": 152
  }
]